# -*- coding: utf-8 -*-
map = {
    'n02085620-Chihuahua': {
        'id': 1,
        'name': '吉娃娃',
        'isAKC': True,
        'desc': '吉娃娃是目前人们所知道最古老的犬种之一，原产于美洲，和墨西哥的古老文明有深厚而密切的关系。吉娃娃属小型犬种里最小型，优雅、警惕、动作迅速，以匀称的体格和娇小的体型广受人们的喜爱。它们可以是宗教的守护者，也是平民的好伴侣，上至贵族下至百姓，不分等级不分贵贱。'
    },
    'n02085782-Japanese_spaniel': {
        'id': 2,
        'name': '日本狮子狗',
        'desc': '日本狮子狗，又称日本猎犬，被认为是对日本贵族十分重要的一种狗，由于经常斜视着眼睛而为人们所知。无论是作为一只宠物还是一个伴侣，这种品种都具有独特的传统。'
    },
    'n02085936-Maltese_dog': {
        'id': 3,
        'name': '马尔济斯犬',
        'isAKC': True,
        'desc': '马尔济斯犬，又称马尔他犬。身高为20－22厘米，体重2－3千克，是欧洲最古老的犬种，原产于地中海的英国属地－马尔他岛，而得此名。马尔济斯犬迄今已有近3000年的历史，在目前犹存的地中海沿岸的工艺品和美术作品中，仍常可见到马尔济斯犬栩栩如生的艺术形象。'
    },
    'n02086079-Pekinese': {
        'id': 4,
        'name': '京巴犬',
        'desc': '京巴犬又称北京犬、宫廷狮子狗，是中国古老的犬种，已有四千年的历史。它是一种平衡良好，结构紧凑的狗，前躯重而后躯轻。它有个性，表现欲强，性格活泼，聪明通人性，其形象酷似狮子。它代表的勇气、大胆、自尊更胜于漂亮、优雅或精致。'
    },
    'n02086240-Shih-Tzu': {
        'id': 5,
        'name': '西施犬',
        'desc': '西施犬，别名狮子犬，原产中国，起源于17世纪。源于西藏，被饲养在喇嘛庙内作为看门狗。 喇嘛教学问之神曼珠休理经常携带会变狮子的小型犬。外形近似狮子的西藏产的拉萨犬被认为和狮子犬关系密切。被毛较长，需要经常梳理。'
    },
    'n02086646-Blenheim_spaniel': {
        'id': 6,
        'name': '骑士查理王小猎犬',
        'isAKC': True,
        'desc': '骑士查理士王小猎犬是一种活泼、文雅、匀称的玩具犬，非常华丽而且大方。具有喜欢运动、勇敢的特点，同时又是文雅、可爱的动物。在这一品种种，这种典型的贵族气质非常重要，它包含了真正的高贵和王室的外貌。这一品种的本质是天然的，不需要经过修整、雕琢或人为改变。原产地英国，起源于15世纪。多数权威认为它起源于日本或中国。很古老的品种，天然的贵族气质，显示了真正的高贵和王室风貌。长毛小猎犬在17世纪的欧洲宫廷很常见，骑士查理王犬常出现在当时的各种油画中，深受英王查理一世和查理二世喜爱，因此以查理王命名。'
    },
    'n02086910-papillon': {
        'id': 7,
        'name': '蝴蝶犬',
        'isAKC': True,
        'desc': '蝴蝶犬（英文名为Papillon）又称蝶耳犬和巴比伦犬，因耳朵上的长毛直立装饰，犹如翩翩起舞的蝴蝶而得名。体高20-28厘米，体重3-5公斤，起源于十六世纪，原产于西班牙，是欧洲最古老的品种之一。'
    },
    'n02087046-toy_terrier': {
        'id': 8,
        'name': '玩具猎狐梗',
        'desc': '玩具猎狐梗是一种玩具犬和梗犬的混和犬种，两者都对它的性格和特性产生了影响。作为梗犬，玩具狐梗拥有敏捷的智力，勇气和活泼。作为玩具犬，它小巧，对主人有无尽的持久的爱。玩具猎狐梗是一种平衡性良好的玩具犬，有健壮的外形，显示出高雅和敏捷，以及同等程度的力量和毅力。'
    },
    'n02087394-Rhodesian_ridgeback': {
        'id': 9,
        'name': '罗得西亚脊背犬',
        'isAKC': True,
        'desc': '罗得西亚背脊犬（英文名Rhodesian Ridgeback），因为其能够捕猎狮子，又叫猎狮犬。罗德西亚脊背犬强壮、灵活，跑动速度很快。它有高贵的气质，对主人极为忠诚，会和陌生人保持一定的距离。'
    },
    'n02088094-Afghan_hound': {
        'id': 10,
        'name': '阿富汗猎犬',
        'isAKC': True,
        'desc': '阿富汗猎犬，是现存的最古老的猎犬犬种之一。此犬种以其厚实、细腻、柔滑的被毛和在末端带有卷曲的尾巴而明显区别于其他犬种。在伊朗东部和阿富汗寒冷的山地特殊环境下，使它们获得这些独特的外观特点。'
    },
    'n02088238-basset': {
        'id': 11,
        'name': '巴吉度猎犬',
        'desc': '巴吉度猎犬(Basset Hound)也称法国短脚猎犬。体高30-48厘米，体重21-25公斤，原产法国，据说是由埃及格雷特猎犬延续繁衍而来的。长身短脚，大而长的垂耳、鼻子嗅觉很敏锐。原被训练为专门捕捉野免、雉鸡等。其腿虽短，但因具有敏锐的嗅觉和长久的耐力，仍不失为追捕猎物的好手。',
    },
    'n02088364-beagle': {
        'id': 12,
        'name': '比格犬',
        'desc': '比格犬又称为“米格鲁猎兔犬”，是世界名犬犬种之一，在分类上属于狩猎犬。头部呈大圆顶的形状，大而榛色的眼睛，广阔的长垂耳，肌肉结实的躯体，尾更粗象鳅鱼状。是漫画史努比的原型犬只。全世界的比格犬大约有十万只左右。'
    },
    'n02088466-bloodhound': {
        'id': 13,
        'name': '寻血猎犬',
        'desc': '寻血猎犬原产地比利时。别名圣·休伯特猎犬（st.huberthound）、侦探犬，是世界上品种最老、血统最纯正、体型最大的嗅觉猎犬之一。具有不屈不挠神奇的嗅觉追踪能力，有事实证明即使是超过14天的气味，它也能追踪到。'
    },
    'n02088632-bluetick': {
        'id': 14,
        'name': '布鲁克浣熊猎犬',
        'isAKC': True,
        'desc': '布鲁克浣熊猎犬，起源于路易斯安那。吻突的轮廓为长为方形，宽而深。圆圆的大眼睛是深棕色的。耳朵薄长的位置得很低。腿很直，尾巴高，形成一个点。后肢很长，肌肉发达。'
    },
    'n02089078-black-and-tan_coonhound': {
        'id': 15,
        'name': '黑褐猎浣熊犬',
        'isAKC': True,
        'desc': '黑褐色猎浣熊犬毛色绝大部分是黑色，其中还带有大约10-15%的棕褐色斑纹。由于它们经常将浣熊赶上树去，因此也被称为“赶上树”猎犬。猎人根据其不同的吠声来判别和辨识它们。完全依靠嗅觉来执行任务，非常有力的、有节奏的步伐使他具有很快的速度。'
    },
    'n02089867-Walker_hound': {
        'id': 16,
        'name': '沃克猎犬',
    },
    'n02089973-English_foxhound': {
        'id': 17,
        'name': '英国猎狐犬',
        'desc': '英国猎狐犬是四大猎狐犬之一，是美国猎狐犬的表亲，它们是气味猎犬，通过气味来捕猎狐狸。英国猎狐犬被精心饲养了150多年，由猎狐犬主人协会（英国）出版的优良品种登记簿可追溯到1800多年以前，并且对于每一个英国猎狐犬的主人来说，追溯它的血统是一件十分容易的事。'
    },
    'n02090379-redbone': {
        'id': 18,
        'name': '红骨猎浣熊犬',
        'isAKC': True,
        'desc': '在美国南部的乔治亚州也有浣熊，当地人们知晓有专门狩猎浣熊的猎犬，所以将它进行繁殖试验，希望能培育出本地的猎浣熊犬新品种。最后用寻血猎犬与古代爱尔兰猎犬交配，终于培育出青出于蓝而胜于蓝的红骨猎浣熊犬。它体高53～66厘米，体重20～32千克。'
    },
    'n02090622-borzoi': {
        'id': 19,
        'name': '俄罗斯猎狼犬',
        'desc': '波索尔（俄罗斯猎狼犬）是作为在开阔地区追逐野兽的猎犬培养的，主要依靠视觉而不是嗅觉捕猎。为了达到这个目的，波索尔需要非常特殊、精确的身体机构，用来捕捉和控制猎物。波索尔具有明显的高贵气质，流畅的线条，动作和姿态优美。'
    },
    'n02090721-Irish_wolfhound': {
        'id': 20,
        'name': '爱尔兰猎狼犬',
        'desc': '爱尔兰猎狼犬,原产地爱尔兰，起源于公元前100年。它是真正的巨犬，是世界上最高大的狗。外观普遍与灵缇犬相似，其被毛十分杂乱；身体结构结实，且肌肉十分发达，从而显出优雅的姿态。结构坚固、稳定，显示出力量，活跃、勇气和匀称性。'
    },
    'n02091032-Italian_greyhound': {
        'id': 21,
        'name': '意大利灰狗',
        'desc': '产于意大利。这种犬在过去是最小型猎犬，大多用它猎兔、猎野鸡，因其小巧可爱逐渐成为家庭玩赏犬。意大利灵缇的最高崇拜者是普鲁士国王弗德里克二世，这位帝国皇帝为 所有死去意大利灵缇建立坟墓，并且把自己也葬在意大利灵缇是坟墓中。著名小说家保罗·杜普莱西斯，也在去世时与自己意大利灵缇安葬在一起。可见意大利灵缇是何种地位。这种犬在美国和欧洲有众多爱好者，至今不衰。'
    },
    'n02091134-whippet': {
        'id': 22,
        'name': '惠比特犬',
        'desc': '惠比特犬是真正的运动型猎犬，中型视觉猎犬，能以最少的动作，跑完最大的距离。给人的印象是漂亮而和谐，肌肉发达，强壮而有力，外形是极度高雅优美。呈流线型的体形是速度的要求。这种犬原产英国，大部分在俄罗斯。它四肢修长，瘦小柔软的身体，是灵缇犬的缩小型。惠比特在国内经常比用来抓兔子，以及猎获小型猎物，以及参加各种赛跑比赛。'
    },
    'n02091244-Ibizan_hound': {
        'id': 23,
        'name': '依比沙猎犬',
        'isAKC': True,
        'desc': '依比沙猎犬的英文名为：IbizanHound。别名：伊维萨猎犬、伊比桑猎犬。它轮廓鲜明，大而直立的耳朵，明快的颜色是他独特的外貌特征。除了耳朵，身上没有过分或夸张的部位。他有能力从静止状态跃起很高的距离。'
    },
    'n02091467-Norwegian_elkhound': {
        'id': 24,
        'name': '挪威猎麋犬',
        'desc': '挪威猎麋犬原产地挪威，起源于11世纪。它是非常勇敢的灰色猎犬，整体来看，它身材中等，轮廓呈正方形，身体的结构结实而牢固，衔接紧凑，比例协调。气质大胆而活跃，一个有主见的守卫犬，但通常都很友善，具有非常高贵而独立的品质。依靠嗅觉工作。挪威猎麋犬是非常勇敢的灰色猎犬。从整体的外观来看，属于典型的北方狗，身材中等，轮廓呈正方形，身体的结构结实而牢固，衔接紧凑，比例协调。头部宽阔，耳朵竖立着，尾巴略向背后卷曲。浓厚而平顺的被毛呈灰色，显得那么的与众不同。作为优秀的猎犬，挪威猎麋犬活泼而有毅力，且非常勇敢，利用吠声把驼鹿或其他大型动物逼到绝路，并避开袭击。具有很强的耐力性，能够在恶劣的气候以及崎岖不平的陆地上进行长时间的工作。'
    },
    'n02091635-otterhound': {
        'id': 25,
        'name': '奥达猎犬',
        'isAKC': True,
        'desc': '奥达猎犬是一种高大的、被毛杂乱的猎犬。嗅觉极端灵敏，对气味好奇，性格和蔼的平静。奥达猎犬能在陆地和水中捕捉猎物，特别喜欢在水中玩耍。奥达猎犬是一种高大的、被毛杂乱的猎犬，壮丽的头部显示出巨大的力量和无比威严，结实的身躯和步幅很大的动作使他能长时间工作。他的嗅觉极端灵敏，对气味好奇，且能坚持研究。奥达猎犬能在陆地和水中捕捉猎物，结合了下列典型特征，大量粗糙的双层被毛；坚固的、有蹼的足爪。'
    },
    'n02091831-Saluki': {
        'id': 26,
        'name': '沙克犬',
        'desc': '沙克犬，又称猎羚犬或拉伯狩猎犬或波斯灵提或者沙路奇猎犬。英文名：Saluki，原产埃及。身高：56～71公分，体重：20～30公斤。沙克犬身体瘦长、前腿高直，窄而长的头，长耳朵悬垂在两侧，肌肉发达的颈部，有力的臀部，自然弯曲的长尾巴，高挑优雅，身轻如燕，非常的漂亮。在阿拉伯半岛南部，至今仍使用沙克犬及猎鹰来捕狩瞪羚及野雁。是靠视觉狩猎的，而不是靠嗅觉。此犬可用极快的速度追逐猎物。任何猎物均能捕获。'
    },
    'n02092002-Scottish_deerhound': {
        'id': 27,
        'name': '苏格兰猎鹿犬',
        'desc': '苏格兰猎鹿犬被赞为“神所创造最完美的生物”，头部吻部呈锥形，反映出在血统上受灵提的影响，甚至被称作粗毛灵提。最初在苏格兰专门为猎鹿而培育，它身高力大，粗糙的毛皮可以抵挡恶劣的气候。现在除了狩猎之外还是很好的伴侣犬。'
    },
    'n02092339-Weimaraner': {
        'id': 28,
        'name': '威玛猎犬',
        'desc': '威玛猎犬(Weimaraner)又称威玛犬，德国魏玛犬，魏玛沃斯特亨德犬，魏玛犬。威玛猎犬是一种中型的灰色犬，形态优雅。它非常美丽，外貌是贵族化的。有非常快的速度，动作十分优雅、美观，毅力非常强，头脑机智、灵敏，身材非常匀称。从它的身体结构来看，它是可以长时间、用非常快的速度来完成它的工作，这说明它具有非常好的耐力。'
    },
    'n02093256-Staffordshire_bullterrier': {
        'id': 29,
        'name': '斯塔福德郡牛头梗',
        'desc': '斯塔福德牛头梗源于英国斯塔福德郡，大约在1700年代由斯塔福德斗牛犬和多种梗犬交配而产生的后裔。它是专为斗狗而培育的品种，但现在好斗本性已经逐渐淡化。对主人的忠诚和牺牲精神非常具有传奇性。1975年被联邦养狗人俱乐部登记承认。外形看起来强壮、机敏而勇敢。'
    },
    'n02093428-American_Staffordshire_terrier': {
        'id': 30,
        'name': '美国斯塔福梗',
        'isAKC': True,
        'desc': '美国斯塔福梗（American Staffordshire Terrier）斯塔福梗是由斗牛犬和梗杂交而来的，最初叫做斗牛犬、牛梗杂交犬，有时被称为斗犬或斗牛梗。后来，在英格兰被命名为斯塔福斗牛梗。 美国斯塔福梗的标准中体重的范围较大，但应该与体形成比例。这种犬以其体形，结实匀称，头部强壮有力，躯体肌肉发达以及勇敢坚强而闻名。 美国斯塔福硬给人的总体印象是：体形有力，紧凑，肌肉发达，而且活泼、热情，喜欢生活的环境。外形粗壮，但腿不宜太长，与外形不和谐。很有勇气。'
    },
    'n02093647-Bedlington_terrier': {
        'id': 31,
        'name': '贝灵顿梗',
        'desc': '贝灵顿梗，脊索动物门，哺乳纲，食肉目，犬科，犬属，原产地英国。外表酷似小绵羊，却有一颗狮子般的心。性格与美丽的外表极不相似，具有争斗心强特性的品种。最初产于英国罗斯伯里,叫做罗斯伯里梗,比现在的品种相比身体重，脚也短,用来猎取狐狸,野兔和獾。据说1825年与贝德灵顿的一只母犬交配生产出了贝灵顿梗。18世纪末到19世纪初，与惠比特犬、丹迪丁蒙梗等犬种混血后，改良出如此身高，美丽，快速敏捷的犬种，并保持原有的活力及耐力性格。贝德灵顿的矿工用作小动物巡回狩猎犬和斗犬。1877年首次作为单独的品种展出。现在它是很好的城市家庭犬和以吠叫报警的看家犬。贝灵顿梗被毛修剪技术十分复杂，因而在第一次修剪时最好有专家做。对于喜欢干净的饲养者来说贝灵顿梗不脱毛是最大优点。'
    },
    'n02093754-Border_terrier': {
        'id': 32,
        'name': '边境梗',
        'isAKC': True,
        'desc': '体型最小的梗犬之一，身高仅有25厘米左右，长有水獭一样的脑袋。体型虽小，外出狩猎时却能紧紧跟着马匹奔跑，能够应付狐狸甚至更难对付的獾。狭窄的身形使它毫不费力地钻过任何狭窄的缝隙并能穿越任何地形，甚至钻进狐兔的洞穴猎取动物。身上厚实的、起伏不平的但很贴身的皮毛可以抵御边境严寒恶劣的气候。据信来源于某种边境猎犬。1921年成立了边境梗犬俱乐部，现已经遍及全世界。',
    },
    'n02093859-Kerry_blue_terrier': {
        'id': 33,
        'name': '凯丽蓝梗',
        'desc': '凯利蓝梗又称爱尔兰梗是爱尔兰国犬。起源于19世纪爱尔兰的凯里郡。蓝色皮毛是它的典型特征。也有传说是1588年在遇难的西班牙无敌舰队逃出之后，漂流到爱尔兰沿海，成为西班牙犬系的子孙，也有人认为，凯利蓝梗是由相当大型的爱尔兰猎狼犬血统发展出来的品种。凯利蓝梗具备多方面的才能，更具备追踪和叼回猎物的本能，它适合各种形式的工作，而且易于训化，具有不屈不挠的精神，看家犬难以超越它。在英格兰的历史上，凯利蓝梗曾胜任警犬的工作。如果饲养管理好，而且专门的食物和指定的训练，凯利蓝梗生命期很长，临近老年依然忠于职守。实际上6～8岁间的凯利蓝梗仍被认为是青年犬。'
    },
    'n02093991-Irish_terrier': {
        'id': 34,
        'name': '爱尔兰梗',
        'desc': '爱尔兰梗，原产地爱尔兰，起源于18世纪。 别名爱尔兰红梗（Irish Red Terrier）。发源于爱尔兰科克郡，一般认为是由黑色、棕褐色和小麦色的梗犬交配繁衍形成的品种。粗毛长腿，外貌特别，样子有点像艾尔谷梗。1879年成立该品种俱乐部，其标准从那时候起没有修改过。其体态优雅，外表漂亮。要饲养该犬并保持其高雅外貌，需要经常修剪和梳理披毛。习性活泼好动，温和， 对主人友善。'
    },
    'n02094114-Norfolk_terrier': {
        'id': 35,
        'name': '诺福克梗',
        'isAKC': True,
        'desc': '诺福克梗是一种小型犬，是拥有丰富猎物的英国诺福克本地梗之一，原产地英国，起源于19世纪，和其近亲诺威奇梗最大的区别之一是那对下垂且向前弯曲的耳朵，在很长的时期内和诺威奇梗混同为一个品种。',
    },
    'n02094258-Norwich_terrier': {
        'id': 36,
        'name': '诺维奇梗',
        'desc': '原产地英国，起源于19世纪。和诺福克梗最大的区别之一是那对灵敏向上竖起的耳朵。根据其体型而论，算得上是力气很大的猎犬。矮小壮实但非常勇敢，喜欢单独或结伴去捕捉害兽，是最小的工作梗之一。'
    },
    'n02094433-Yorkshire_terrier': {
        'id': 37,
        'name': '约克郡梗',
    },
    'n02095314-wire-haired_fox_terrier': {
        'id': 38,
        'name': '刚毛猎狐梗',
        'desc': '刚毛猎狐梗为19世纪猎狐而产生的犬种，祖先包括了粗毛黑白梗及许多梗类血统。而短毛猎狐梗是由短毛黑白梗和米格鲁斗牛犬与灵缇配种产生的，此犬曾担任过军犬，并有过辉煌的纪录。刚毛猎狐“德勒马捷科”在一次世界大战时随英国近卫军征战，荣获服务勋章。刚毛猎狐梗极度聪明，有对新的事物充满好奇，所以只要是有趣的东西，它们很乐意去学习，并能轻松完成任务，了解常见的犬病及日常行为，可使犬更加健康的成长。'
    },
    'n02095570-Lakeland_terrier': {
        'id': 39,
        'name': '湖畔梗',
        'isAKC': True,
    },
    'n02095889-Sealyham_terrier': {
        'id': 40,
        'name': '锡利哈姆梗',
        'isAKC': True,
        'desc': '锡利哈姆梗是从1850年到1891年之间，在威尔士的锡利哈姆，由约翰·爱德华大尉精心改良出的品种。当时没有留下确切的配种纪录，但可以判断是通过牛头梗、西部高地白梗、短脚长身梗以及威尔士柯基犬混种而产生。1903年此犬首次在威尔士当地举行的犬展上登场展出。1908年该犬的俱乐部成立于锡利哈姆，1911年被美国养狗人俱乐部（AKC）及英国养狗人俱乐部（KC）登记承认。该犬培育用来猎取狐狸、水獭和獾等动物，具有快速挖洞的能力，能钻入洞穴猎捕目标。目前它也是非常优秀的伴侣犬和展示犬。'
    },
    'n02096051-Airedale': {
        'id': 41,
        'name': '艾尔谷犬',
        'desc': '艾尔谷梗，又名万能梗，是梗犬中体型最大的一种。拥有黑色和棕褐色相间的独特皮毛，身上的硬毛既浓密又能防水。每年会脱两次毛，可以趁这个时候进行梳剪。 黄眼睛，猎犬式的耳朵，白色的脚，软毛，体型太大或者太小，上颚或者下颚凸出，运动不协调等缺点在比赛中都是要被扣分的。起源于19世纪，原产英国，生性吃苦耐劳，培育自英格兰南部约克郡，是古老的梗犬和猎水獭犬的后代。通常被训做猎獾和水獭。'
    },
    'n02096177-cairn': {
        'id': 42,
        'name': '凯恩梗',
        'desc': '凯恩梗，原产地英国，起源于16世纪。活泼、惹人喜爱的凯恩梗属于工作梗中之最小型品种。凯恩(Cain)这个词是石堆的意思，苏格兰高地的一些石堆，是古代罗马人的墓志。凯恩梗即善于追踪那些在石堆里的老鼠，狐狸，有时追捕凶猛的欧洲猫。'
    },
    'n02096294-Australian_terrier': {
        'id': 43,
        'name': '澳大利亚梗',
        'isAKC': True,
        'desc': '澳大利亚梗(AustralianTerrier)又叫澳洲梗，此新品种是本世纪初期培养而成的，这种狗具有聪明而灵活的头脑，强健的身体，是伴侣犬与玩赏犬的最佳选择。'
    },
    'n02096437-Dandie_Dinmont': {
        'id': 44,
        'name': '丹迪丁蒙梗',
        'desc': '丹迪丁蒙梗，原产地英国，起源于17世纪。最古雅别致的宠物犬之一。许多宠物都是因饲养地或繁衍发展的地方而得名，丹第丁蒙更犬却是以著名作家瓦尔德·斯科特爵士（alter Scott）的作品中的主角名字来命名的。早在1700年代，苏格兰和英格兰的交界地区饲养的丹第丁蒙梗犬，就因为它能够捕食水獭和獾而名声在外，从而成为独特的一个品种。据信是苏格兰梗和斯凯梗交配产生的品种。'
    },
    'n02096585-Boston_bull': {
        'id': 45,
        'name': '波士顿梗',
        'desc': '波士顿梗是少数在美国育种的犬种之一，是一种活泼的、智商非常高的、被毛平滑、头部短、结构紧凑、短尾巴、非常匀称的狗，颜色上是虎斑色、海豹色或黑色带有均匀的白色斑纹。头部的尺寸与身躯的比例协调，表情显示出非常高的智商。尽管没什么特殊的地方，但是可作优秀的警卫或伴侣犬。'
    },
    'n02097047-miniature_schnauzer': {
        'id': 46,
        'name': '迷你雪纳瑞犬',
        'desc': '迷你雪纳瑞犬（MINIATURESCHNAUZER）属于梗犬类，体形为12至14英寸。在德国被称为茨威格雪纳瑞犬，由普通雪纳瑞犬和小型犬杂交得到。在美国和加拿大，迷你型雪纳瑞犬曾经是最普及的犬。迷你雪纳瑞属于梗类犬的一种，他们精力充沛、活泼，他们的外型及性格与他们的表亲—标准雪纳瑞十分类似，警惕而活泼。缺点：玩具化、过于纤细或粗糙。'
    },
    'n02097130-giant_schnauzer': {
        'id': 47,
        'name': '巨型雪纳瑞犬',
        'desc': '巨型雪纳瑞是15世纪时起源于德国的，它是粗毛牧牛犬和迷你雪纳瑞经过杂交而产生的后代。巨型雪纳瑞的质包括了热情和机警，聪明而可靠，沉着、警觉、勇敢、容易训练、对家庭非常忠实，爱玩闹，安静时显得和蔼，警觉时显得有支配力。健康而可信赖的气质、粗糙的外表、能应付各种气候的浓密的粗毛使这一品种成为了力量和耐力具佳、具有一种或多种用途的工作犬。'
    },
    'n02097209-standard_schnauzer': {
        'id': 48,
        'name': '标准雪纳瑞犬',
        'desc': '标准雪纳瑞是一种精力充沛、体格魁梧的梗犬，发达的肌肉和充足的骨量构成了他坚强的体格；他的身高与体长的比例呈正方形。被毛浓密、粗硬且粗糙不平是这一品种非常重要的特点，他还长有弯弯的眉毛和刚毛的胡须，性情温顺，适合家养。雪纳瑞耳朵弯曲，耳壁内易生耳螨，所以雪纳瑞在幼犬时期就会做剪耳。'
    },
    'n02097298-Scotch_terrier': {
        'id': 49,
        'name': '苏格兰梗',
        'desc': '苏格兰梗别名亚伯丁梗（Aberdeen Terrier），绰号“苏格兰小子”。历史非常久远，但其确切的源头谱系已经不清楚。1882年该犬的标准被制定出来。相对于其娇小的身躯，它的力量非常大。在日常饲养中要确保营养平衡，定时定点的饲喂，养成良好的习惯。被毛起伏不平，每日可梳理犬毛，保持干净及良好的形象。同时也应该了解常见的犬病及繁殖行为，对犬和养犬人士自身都是很重要的。'
    },
    'n02097474-Tibetan_terrier': {
        'id': 50,
        'name': '西藏梗',
        'desc': '西藏梗犬并不是真正的梗，而是一种牧羊犬，类似于欧洲长着蓬乱毛皮的牧羊犬。它们的家乡是海拔5000米高的、有世界屋脊之称的西藏高原。在上世纪20年代，英国女医生阿格瑞斯·格瑞格博士在紧靠西藏的印度工作，一位富有的西藏人为了感谢她高超的医术，送给她了一条西藏梗。女医生被这种梗深深地吸引，她的余生全部用在了饲养这种梗上。这样，西藏梗便在欧洲安家落户。'
    },
    'n02097658-silky_terrier': {
        'id': 51,
        'name': '丝毛梗',
        'desc': '丝毛梗性格开朗活泼，有时很顽皮，是纯粹被人类用来做伴侣。此犬保持梗类活力充沛，自我主张强烈的特性。在澳洲也能发挥梗类追杀小动物的技能。丝毛梗可爱， 快活，聪明 ，陌生人靠近时，会有警戒心，为都市居民的理想看家犬或家庭犬。其体态娇小轻盈、机敏活泼，拥有典型的梗犬特点。'
    },
    'n02098105-soft-coated_wheaten_terrier': {
        'id': 52,
        'name': '爱尔兰软毛梗',
        'desc': '爱尔兰软毛梗的英文名称为：Soft Coated Wheaten Terrier。别名：软毛麦色梗和短毛麦色梗。原产地：爱尔兰；它是一种中等体型、勇敢、协调性很好的运动梗。是爱尔兰最古老的梗犬。爱尔兰软毛梗是快乐、坚定的狗，显得自得其乐和自信。他警惕，显得对周围的环境感兴趣。与其他梗类犬比较，显得攻击性弱一些。'
    },
    'n02098286-West_Highland_white_terrier': {
        'id': 53,
        'name': '西高地白梗',
        'desc': '西高地白梗是一种小体型、爱玩的、坚定的梗类犬，具有良好的艺术气质，非常自负，身体结构结实，胸部和后腰较深，后背笔直，后躯有力，腿部肌肉发达，显示出强大的力量和活力的组合。被毛约2英寸长，白色，质地硬，长有浓密而柔软的底毛。在饲喂中不要给犬巧克力，巧克力对犬类是致命的，可可碱这种成分会刺激心肌和中枢神经系统，导致巧克力中毒。了解常见的犬病及犬的繁殖行为可使犬更健康的成长。日常护理中犬毛的梳理，可是爱犬 形象气质佳。'
    },
    'n02098413-Lhasa': {
        'id': 54,
        'name': '拉萨犬',
        'desc': '拉萨犬(Chrysanthemum)。拉萨犬原产于青藏高原,形体外貌如狮子，毛色有金黄色、朱砂色、灰色、花色和黑、白、茶等各种颜色，被毛长而丰富，特别是头部、耳部、尾部被毛最厚实，可拖至地面。善有胡须和长的颜鬓，尾上翘，呈菊花形尾。现在是非常理想的家庭犬。拉萨犬又被称为“驱魔圣犬”。这种犬一般体重6~7kg，体高25~28cm，寿命较长，18~20年。拉萨犬虽然其体形不大，天性不凶悍，但一直是西藏达赖喇嘛的护卫犬。这种犬不但韧性很强，而且听力相当敏锐。它的英文名的原意是“宛如山羊一般”，而山羊在西藏的神话中扮演着特殊的角色。'
    },
    'n02099267-flat-coated_retriever': {
        'id': 55,
        'name': '弗莱特寻回犬',
        'isAKC': True,
        'desc': '弗莱特寻回犬，又称平毛寻回犬。弗莱特寻回犬具有一个强烈的个人向往和一种令人喜欢的自我照顾能力。它是一种快乐、活泼的狗，表情聪明，线条整洁。它与众不同的、非常重要的特征是他的侧面轮廓（不论在运动中，还是站立着），平滑、轻松的动作，头部类型，被毛和特征，这些都是该品种独特的特征。'
    },
    'n02099429-curly-coated_retriever': {
        'id': 56,
        'name': '卷毛寻回犬',
        'desc': '卷毛寻回犬，顾名思义，它的被毛是卷的。它的独立和冷静，使他从来不会显得羞怯，不会自得其乐。在犬展上，气质正确的卷毛寻回犬会坚定地站在自己的位置，服从性很好；在野外，卷毛寻回犬非常热情、稳固、天性勇敢；在家里，他显得平静而友善。卷毛寻回犬是最古老的寻回犬之一，拥有惊人的嗅觉和记忆力。'
    },
    'n02099601-golden_retriever': {
        'id': 57,
        'name': '金毛寻回犬',
        'desc': '金毛寻回犬（英语：Golden Retriever）是比较现代并很流行的狗的品种，是单猎犬，作为用来在猎捕野禽的寻回犬而培养出来的，游泳的续航力极佳。金毛寻回犬是最常见的家犬之一，因为它很容易养，有耐心并且对主人要求不多，只要定期的运动，食物和兽医体检就可以了。金毛的独特之处在于它讨人喜欢的性格，是属于匀称、有力、活泼的一个犬种，特征是稳固、身体各部位配合合理，腿既不太长也不笨拙，表情友善，个性热情、机警、自信而且不怕生。金毛犬最早是一种寻回猎犬。现在大多作为导盲犬与宠物狗。对小孩子或者婴儿十分友善。金毛犬是位列世界犬种智商排行的第四名。'
    },
    'n02099712-Labrador_retriever': {
        'id': 58,
        'name': '拉布拉多寻回犬',
        'desc': '拉布拉多又称寻回犬，是一种大型犬类，是非常适合被选作经常出入公共场合的导盲犬或地铁警犬及搜救犬和其他工作犬的狗品种，因原产地在加拿大的纽芬兰与拉布拉多省而得名。跟西伯利亚雪撬犬和金毛寻回犬并列三大无攻击性犬类。拉布拉多智商位列世界犬类第六位。个性忠诚、大气、憨厚、温和、阳光、开朗、活泼，智商极高，也对人很友善。'
    },
    'n02099849-Chesapeake_Bay_retriever': {
        'id': 59,
        'name': '切萨皮克海湾寻回犬',
        'isAKC': True,
        'desc': '切萨皮克海湾寻回犬（Chesapeake Bay Retriever）起源于英格兰，但关于它的发展没有完全和可靠的记载。这些犬性情聪明、快乐，并带有智慧的表情。而且经常被要求在一天内从海湾水中猎取100～200只水鸭。'
    },
    'n02100236-German_short-haired_pointer': {
        'id': 60,
        'name': '德国短毛猎犬',
        'isAKC': True,
        'desc': '德国短毛指示猎犬(German Shorthaired Pointer) 具备了大众所喜欢猎犬的优秀品质。这些品质包括灵敏的嗅觉能力，较高的理解力，并通过与西班牙指示猎犬、英国猎狐犬和德国当地追踪犬的后代进行杂交繁殖，将这些品质融合到这一犬种中。如此育种造就了这种犬的野外能力。它的这种可改造性为它赢得了“全能犬”的美誉。事实上，早在l920年美国运动员（赛犬运动员）开始引进这一犬种前，德国人已经给了它这个荣誉。'
    },
    'n02100583-vizsla': {
        'id': 61,
        'name': '维兹拉犬',
        'desc': '维兹拉犬是一种中等体型的短毛猎犬，相貌和姿势高贵。精力充沛且结构轻盈一些比较好；被毛是有魅力的金锈色。这种狗在野外显得非常有力且驱动力强大，但在家庭中，却是容易调教的、挚爱的伴侣犬。它有良好的嗅觉，且接受训练的能力高于一般水平。善于指示猎物，又可寻取猎物。'
    },
    'n02100735-English_setter': {
        'id': 62,
        'name': '英国蹲猎犬',
        'isAKC': True,
        'desc': '英国蹲猎犬的英文名为English Setter。它仪表端庄，性情温和，最适宜作为小孩子们的忠实伙伴，也由于其美貌和温柔共存而颇受人们喜爱。现代的英格兰雪达犬可分为两种类型：一种生长于平狭高地(Laverack)，另一种活跃于田间（Llewelin），前者是伴侣犬和展览犬较为理想的候选品种，而后者在担当防卫的工作中常常倍受重用。'
    },
    'n02100877-Irish_setter': {
        'id': 63,
        'name': '爱尔兰雪达犬',
        'desc': '爱尔兰雪达犬是一种活跃的、贵族化的猎鸟犬，颜色是浓烈的红色，结构坚固，但很文雅。站立时，肩高超过2英尺，他拥有直、细腻、且有光泽的被毛，耳朵、胸部、尾巴和腿后面的毛发略长。在野外，爱尔兰雪达犬是动作迅速的猎手，在家庭里，他又是性情甜蜜，容易调教的伴侣适合与小孩做伴，经常梳理犬毛可是犬保持干净整洁的良好形象，也减少皮肤病的滋生。了解掌握常见的犬病对犬和养犬者都是很重要的。了解繁殖行为可是犬更好的繁殖后代。'
    },
    'n02101006-Gordon_setter': {
        'id': 64,
        'name': '戈登雪达犬',
        'isAKC': True,
        'desc': '戈登雪达犬是一种大小合适，结构坚固，黑色和棕色的狗，肌肉发达，骨量充足，但相当活跃，挺拔、且时髦，显示出有能力整天在野外工作。他拥有结实，且短的背部，支撑良好的肋骨，短尾巴。头部相当沉重，轮廓清晰、细腻。他的气质是聪明、高贵且威严，没有任何羞怯或恶意的迹象。颜色清晰，直或略呈波浪状的被毛是正确的。'
    },
    'n02101388-Brittany_spaniel': {
        'id': 65,
        'name': '布列塔尼猎犬',
        'isAKC': True,
        'desc': '该犬种起初是以它的发源地——法国某省来命名的。从1934年到1982年，美国养犬俱乐部(AKC)才将这种垂耳长毛犬注册。并定名为布列塔尼猎犬。作为一种长毛垂耳犬，布列塔尼猎犬的行为方式与塞特猎犬很相似，只是体形上比塞特猎犬小，但比长毛垂耳犬大。具有一头短尾巴和一对很有特征性的长耳朵。实际上，该犬种是在1982年9月1日才正式由美国养犬俱乐部定名为布列塔尼猎犬的。'
    },
    'n02101556-clumber': {
        'id': 66,
        'name': '西班牙小猎犬',
        'isAKC': True,
    },
    'n02102040-English_springer': {
        'id': 67,
        'name': '英国史宾格犬',
        'desc': '英国史宾格犬是一种中型运动犬，身躯紧凑，且断尾。被毛长度适中，在腿部、耳朵、胸部、腹部有羽状饰毛。他下垂的耳朵、温柔文雅的表情、坚定的结构和友好地摆动的尾巴，宣布他无疑是猎鹬犬这一古老家族中的一员。'
    },
    'n02102177-Welsh_springer_spaniel': {
        'id': 68,
        'name': '威尔士史宾格犬',
        'isAKC': True,
        'desc': '威尔士史宾格犬的英文名是Welsh Springer Spaniel，是一种古老而独特的品种，此犬因捕猎本领而得名，并不与其它存在任何联系。且是一种充满魅力的犬种，身体结构结实而不粗糙，显得十分灵活。身体紧凑，中等长度的腿部，从健壮的身躯显示出能够完成非常艰苦的工作。且具有很强的耐力性。由于前躯适当的倾斜而形成的角度与发达的后躯之间的关联，从而使威尔士史宾格犬的整体显得比较长。作为猎犬，在工作时，则应显示出发达的肌肉。'
    },
    'n02102318-cocker_spaniel': {
        'id': 69,
        'name': '可卡犬',
        'desc': '可卡犬又名猎鹬犬，犬种可分为英国可卡犬和美国可卡犬，其祖先为西班牙猎犬。最初可卡犬由西班牙传入英国，用于捕猎禽类，而后带到美国被大量繁殖和改良，变为现在体型较小的两种可卡犬。可卡犬具有结实紧凑的身体与轮廓分明且精致的头部。身体结实，整体匀称。其前腿直立支撑肩部，而背部的形状是由肩开始稍向肌肉发达的后躯倾斜。在它们运动时既有速度又有耐力。性格自由活泼，性情平稳，没有羞怯的迹象。'
    },
    'n02102480-Sussex_spaniel': {
        'id': 70,
        'name': '苏塞克斯猎犬',
        'isAKC': True,
        'desc': '苏塞克斯猎犬是AKC在1884年出版的品种手册中最先得到承认的10个品种之一，但作为一种独特的品种，它出现的时间更早。就象它的名字所指出的那样，它起源于英格兰的塞式郡，从18世纪开始，在野外使用的一种犬。'
    },
    'n02102973-Irish_water_spaniel': {
        'id': 71,
        'name': '爱尔兰水猎犬',
        'desc': '爱尔兰水猎犬是一种漂亮的、结构坚固的运动犬，非常聪明，结合了耐力和胆大的性格，活跃、热情的气质。独特的特征在于顶髻上长而松散的卷毛，身躯上覆盖着浓密、清晰的肝色卷毛，与他平滑的脸部及平滑的“老鼠”尾巴形成鲜明的对照。性情快乐、顺从、聪明，敏感而顽皮。它是猎犬中身材最魁梧的成员，善于猎取动物尤其是水禽。',
    },
    'n02104029-kuvasz': {
        'id': 72,
        'name': '库瓦兹犬',
    },
    'n02104365-schipperke': {
        'id': 73,
        'name': '西帕基犬',
        'desc': '西帕基犬是非常忠心的看门犬， 虽不喜欢争斗， 但除了保护主人式家人， 即使对手再大， 也会勇气应战， 胆子很大。好奇心旺盛， 警戒性极强， 是很棒的看门犬。 此外， 也是猎害兽犬， 独立性强， 充满自信。又被称为 “最佳室内犬” , 是孩子游戏的对象， 心地温柔。'
    },
    'n02105056-groenendael': {
        'id': 74,
        'name': '比利时牧羊犬',
        'isAKC': True,
    },
    'n02105162-malinois': {
        'id': 75,
        'name': '马里努阿犬',
    },
    'n02105251-briard': {
        'id': 76,
        'name': '布雷猎犬',
        'isAKC': True,
    },
    'n02105412-kelpie': {
        'id': 77,
        'name': '凯尔皮犬',
    },
    'n02105505-komondor': {
        'id': 78,
        'name': '匈牙利牧羊犬',
    },
    'n02105641-Old_English_sheepdog': {
        'id': 79,
        'name': '老英国牧羊犬',
    },
    'n02105855-Shetland_sheepdog': {
        'id': 80,
        'name': '喜乐蒂牧羊犬'
    },
    'n02106030-collie': {
        'id': 81,
        'name': '柯利牧羊犬',
    },
    'n02106166-Border_collie': {
        'id': 82,
        'name': '边境柯利牧羊犬',
    },
    'n02106382-Bouvier_des_Flandres': {
        'id': 83,
        'name': '波兰德斯布比野犬',
        'isAKC': True,
    },
    'n02106550-Rottweiler': {
        'id': 84,
        'name': '罗威纳犬',
    },
    'n02106662-German_shepherd': {
        'id': 85,
        'name': '德国牧羊犬',
    },
    'n02107142-Doberman': {
        'id': 86,
        'name': '多伯曼犬',
    },
    'n02107312-miniature_pinscher': {
        'id': 87,
        'name': '迷你杜宾犬',
    },
    'n02107574-Greater_Swiss_Mountain_dog': {
        'id': 88,
        'name': '大瑞士山地犬',
    },
    'n02107683-Bernese_mountain_dog': {
        'id': 89,
        'name': '伯恩山犬',
    },
    'n02107908-Appenzeller': {
        'id': 90,
        'name': '阿彭策尔犬',
    },
    'n02108000-EntleBucher': {
        'id': 91,
        'name': '恩特雷布赫山地犬',
    },
    'n02108089-boxer': {
        'id': 92,
        'name': '拳师狗',
    },
    'n02108422-bull_mastiff': {
        'id': 93,
        'name': '斗牛獒犬',
        'isAKC': True,
        'desc': '斗牛獒犬是具备斗牛犬的勇气与凶猛，獒犬的力量及速度，敏锐的嗅觉，能有效率的追踪偷猎者并有足够的体力和力量扑倒或制服偷猎者的动物。此犬接到主人的命令后立即出击，将对手控制住而不将其伤害。美国斗牛獒犬更具獒犬特征。头部头盖大且方，眉头分明，鼻口部短而宽。耳小，呈V字型，耳根高且两耳距离大，下折，颜色比身体暗。眼大小适中，颜色有暗色或淡茶色，两眼之间皱纹深。眼眶为暗色，鼻口部宛如戴上黑色口罩。体格坚挺，胸部厚且宽，背部则短且平。前肢直且力强，两脚间隔大，后肢肌肉发达。足坚硬，脚尖圆如猫足，肉趾硬，爪为暗色。'
    },
    'n02108551-Tibetan_mastiff': {
        'id': 94,
        'name': '藏獒',
    },
    'n02108915-French_bulldog': {
        'id': 95,
        'name': '法国斗牛犬',
    },
    'n02109047-Great_Dane': {
        'id': 96,
        'name': '大丹犬',
    },
    'n02109525-Saint_Bernard': {
        'id': 97,
        'name': '圣伯纳犬',
    },
    'n02109961-Eskimo_dog': {
        'id': 98,
        'name': '爱斯基摩犬',
    },
    'n02110063-malamute': {
        'id': 99,
        'name': '阿拉斯加雪橇犬',
    },
    'n02110185-Siberian_husky': {
        'id': 100,
        'name': '哈士奇',
        'isAKC': True,
        'desc': '西伯利亚雪橇犬，常见别名哈士奇，昵称为二哈。西伯利亚雪橇犬是原始的古老犬种，在西伯利亚东北部、格陵兰南部生活。哈士奇名字的由来，是源自其独特的嘶哑声。哈士奇性格多变，有的极端胆小，也有的极端暴力，进入大陆和家庭的哈士奇，都已经没有了这种极端的性格，比较温顺，是一种流行于全球的宠物犬。与金毛犬、拉布拉多并列为三大无攻击型犬类。被世界各地广泛饲养，并在全球范围内，有大量该犬种的赛事。'
    },
    'n02110627-affenpinscher': {
        'id': 101,
        'name': '狮毛狗',
    },
    'n02110806-basenji': {
        'id': 102,
        'name': '巴仙吉犬',
        'isAKC': True,
        'desc': '巴仙吉犬，英文名Basenji，属于狩猎犬。巴仙吉犬源于非洲则为小型的短毛猎犬。背部短，且身体结构显得十分轻盈，对于此犬的长度来说，其腿显得略长一些。头部长有皱纹，且高傲地昂着，圆拱的颈部支撑着头部，尾巴位于臀部较高的位置，且呈卷曲的。具有文雅而优美的气质，显得和谐而好奇且充满机警。由于整体的身躯保持平衡，肌肉组织很平滑，因此导致具有轻松而敏捷的动作。巴仙吉犬通过本身所具备的视觉与嗅觉而用来狩猎。'
    },
    'n02110958-pug': {
        'id': 103,
        'isAKC': True,
        'name': '哈巴狗',
    },
    'n02111129-Leonberg': {
        'id': 104,
        'name': '莱昂贝格狗',
    },
    'n02111277-Newfoundland': {
        'id': 105,
        'name': '纽芬兰岛狗',
    },
    'n02111500-Great_Pyrenees': {
        'id': 106,
        'name': '大白熊犬',
    },
    'n02111889-Samoyed': {
        'id': 107,
        'name': '萨摩耶犬',
    },
    'n02112018-Pomeranian': {
        'id': 108,
        'isAKC': True,
        'name': '博美犬',
    },
    'n02112137-chow': {
        'id': 109,
        'name': '松狮',
    },
    'n02112350-keeshond': {
        'id': 110,
        'name': '荷兰卷尾狮毛狗',
    },
    'n02112706-Brabancon_griffon': {
        'id': 111,
        'name': '布鲁塞尔格里芬犬',
        'isAKC': True,
    },
    'n02113023-Pembroke': {
        'id': 112,
        'name': '彭布洛克威尔士科基犬',
    },
    'n02113186-Cardigan': {
        'id': 113,
        'name': '威尔士柯基犬',
    },
    'n02113624-toy_poodle': {
        'id': 114,
        'name': '玩具贵宾犬',
    },
    'n02113712-miniature_poodle': {
        'id': 115,
        'name': '迷你贵宾犬',
    },
    'n02113799-standard_poodle': {
        'id': 116,
        'name': '标准贵宾犬',
    },
    'n02113978-Mexican_hairless': {
        'id': 117,
        'name': '墨西哥无毛犬',
    },
    'n02115641-dingo': {
        'id': 118,
        'name': '澳洲野狗',
    },
    'n02115913-dhole': {
        'id': 119,
        'name': '豺',
    },
    'n02116738-African_hunting_dog': {
        'id': 120,
        'name': '非洲猎犬'
    },
    'z-Keeshoud': {
        'id': 121,
        'name': '荷兰毛狮犬',
        'isAKC': True,
        'desc': '荷兰毛狮犬的性情很开朗，特别容易与人亲近，有着非常好的记忆力，善于对事物进行观察，是一个出色的警卫犬。体型比较大，但并不占地方，乘坐荷兰船的这类祖先犬，习惯的把身子蜷缩成一个圆形，是为了不占地方。荷兰毛狮犬对自己的饲主非常忠心，给饲养者带来无尽的欢乐。尽管几百年以来荷兰狮毛犬（也有人译作“凯斯犬”）一直是荷兰人民最喜爱的犬之一，但是直到18世纪后半叶由于荷兰国内政治的翻转它才引起人们的广泛关注。荷兰狮毛犬从来没有用来作狩猎犬，荷兰狮毛犬以它的品格魅力，在一个民族的情感中赢得了一个很高的地位。'
    },
    'z-akita_dog': {
        'id': 122,
        'name': '秋田犬',
        'isAKC': True,
        'desc': '秋田犬（あきたいぬ/アキタイヌ）是日本国犬，在日本是家庭宠物犬。秋田犬是日本最大的狐狸犬种，这一大型狐狸犬就算在欧洲和美国这种狐狸犬种众多的国家也颇为引人瞩目。在日本，秋田犬是具有国家历史文物意义的犬，属国犬，因“忠犬八公”闻名于世，是日本指定的国家天然纪念物中唯一的大型犬。该犬十分勇猛、感觉锐敏、忠诚且聪明，有关其忠诚的故事很多。秋田县是秋田犬发祥地，该地区北部多山，而且冬季十分寒冷。秋田犬是能干的工作犬和看家犬，村民们常常带着犬去猎杀野猪和熊，犬最拿手的本领是帮猎人在雪地或水中寻找被击中的猎物，寻回后交给主人。'
    },
    'z-american_eskimo': {
        'id': 123,
        'name': '美国爱斯基摩犬',
        'isAKC': True,
        'desc': '美国爱斯基摩犬是波美拉尼亚丝毛犬家族中的一员，也有许多养犬爱好者更愿意将其归属为北欧品种。美国爱斯基摩犬主要起源于欧洲波美拉尼亚犬种，包括白色德国波美拉尼亚丝毛犬，白色荷兰卷尾犬、白色波美拉尼亚犬和白色意大利波美拉尼亚丝毛犬。二战以后，西海岸的犬培育者甚至将日本波美拉尼亚犬的血统加入到爱斯基摩犬当中。 在19世纪的美国，德国移民社区里经常可以见到小型的白色波美拉尼亚类型的犬，它们同主人一道从欧洲迁离，在到达美国后这些犬在本国不再被认可，它们便被称作美国爱斯基摩犬。'
    },
    'z-bordeaux': {
        'id': 124,
        'name': '波尔多犬',
        'isAKC': True,
        'desc': '波尔多犬别名法国獒、波尔多斗牛犬。法国的波尔多地区曾经被英国统治，当地的猎犬与英国马士提夫犬，还有西班牙的同类犬杂交产生了这种强有力、凶猛的獒。作为一种工作犬，波尔多犬最初在法国南部用于狩猎野猪和熊，后来用于牧牛。由于它的勇敢，波尔多獒曾用于诱兽和斗犬。直到1989年它与汤姆.汉克斯一同出现在美国的荧幕上，波尔多獒才为法国以外的世人所知，它具有招人喜欢的特点，如无穷的力量.对陌生人的警惕和威胁。波尔多犬布满皱褶的巨大的头给人好斗的印象，宽短且有明显的阻隔，椭圆型的眼睛间距大有明显的上脊，小而直立的耳朵微微环绕耳根部，尾巴短，无绒毛 。'
    },
    'z-dachshund': {
        'id': 125,
        'name': '腊肠犬',
        'isAKC': True,
        'desc': '腊肠犬（Dachshund）是一种短腿，长身的猎犬。其名源于德国，原意"獾狗"。此品种被发展为嗅猎，追踪，及捕杀獾类及其他穴居的动物．有意思的是，虽然"Dachshund"是一个德语单词，但是它在德国并不常用，德国人通常叫它Dackel或Teckel。原产于德国，现遍及各地。腊肠犬在所有狗种中是比较好养的。因为腊肠犬的天性独立自主，所以照顾起来很容易，主人下达的指令也都会迅速理解遵从。'
    },
    'z-dalmatian_breed_standard': {
        'id': 126,
        'name': '大麦町犬',
        'isAKC': True,
        'desc': '大麦町犬（Dalmatian，也叫斑点狗），原产地南斯拉夫。平静而警惕、轮廓匀称、强健、肌肉发达、且活泼，毫不羞怯，表情聪明伶俐，听话易训，感觉敏锐，警戒心强，容易与小孩相处。大麦町犬具有极大的耐力，而且奔跑速度相当快。后躯有力，拥有平滑且清晰的肌肉。大麦町因为拥有出色的奔跑与撕咬能力，所以也经常被用作比赛犬。大麦町犬出生时是白色的，斑点能改变，小狗时身上出现轻微的斑点，随着逐渐长大，斑点也变得明显，并成为特有的标志。'
    },
    'z-doberman_pinscher': {
        'id': 127,
        'name': '杜宾犬',
        'isAKC': True,
        'desc': '杜宾犬即笃宾犬。原产德国，它是根据培育这一品系人的名字路易斯·杜宾曼先生命名的，是所有品系中极富智慧的并且身体结构最为优秀，气质最为高贵的一种。杜宾犬是军、警两用的犬只，同时国内也有部分人将未裁耳、断尾的杜宾当做猎犬使用。在国内杜宾犬通常被用于护卫和狩猎。杜宾犬在饲养过程中最重要的问题就是耳朵方面的问题，杜宾犬的护理很简单，杜宾犬是要求做剪耳的，耳朵做的好坏决定了这条杜宾犬的相貌与气质。养犬人士了解常见的犬病和繁殖行为对犬和养犬人士自身也是很有必要的。'
    },
    'z-pembroke_welsh_corgi': {
        'id': 128,
        'name': '彭布罗克威尔士柯基犬',
        'isAKC': True,
        'desc': '彭布罗克威尔士柯基犬低矮，强壮，结实而活跃，给人印象身体所占空间位置小。但身体不能太矮，骨头不能太重，否则会显得粗糙、多余，也不能太轻，否则会显得太活跃。外观勇敢，和蔼，表情显得聪明，对外界感兴趣。既不胆怯也不凶恶。 恰当的平衡性与轮廓、有魅力的脑袋、聪明的神态与合适的性情是首要条件。犬的运动状态也是很重要的，尤其是从一侧观察。步态平滑自如的犬是较理想犬，应受到高度重视。在以上所介绍的特点中，不应有任何小的缺点。'
    },
    'z-pit_bull_terrier': {
        'id': 129,
        'name': '斗牛梗',
        'isAKC': True,
        'desc': '斗牛梗，别名斗兽场斗牛梗(Pit Bull Terrier)、美国斗牛犬（American Pit Bull），最早起源于英国。起初被用于农场放牛和狩猎，曾经被称为忠诚的家庭宠物。英文的斗牛梗一词特指国内所谓的牛头梗。起初被用于农场放牛和狩猎，曾经被称为忠诚的家庭宠物。后来被人们训练繁育为斗狗，专供人们斗狗取乐。用斯塔福德牛头梗和斗牛犬交配并经过数代的繁衍，逐渐形成了凶悍好斗的性格，在斗狗场上，斗牛梗英勇好战，一旦咬住对方的脖子决不松口，即使被打死也不退让。斗牛梗其实只是中型犬，但力大无比，这种狗据说当咬住别的动物或人时，上下颌就被锁住，死不松口。'
    },
    'z-shiba_inu': {
        'id': 130,
        'name': '柴犬',
        'isAKC': True,
        'desc': '柴犬是体型中等并且又最古老的犬。柴犬能够应付陡峭的丘陵和山脉的斜坡，拥有灵敏的感官，使得柴犬屡次成为上乘的狩猎犬。柴犬性格活泼、好动。对自己喜欢的玩具、会一天到晚的把玩。其对外有极强警惕性，能为户主看家护院。其特别是对大型同类，并且不服输。草丛中的耗子、鸟都会是它的猎物及玩具。柴犬是日本国宝，常见的赤色柴犬价格都在6000元到30000元之间。'
    }
}
