# -*- coding: utf-8 -*-
map = {
    'n02085620-Chihuahua': {
        'id': 1,
        'name': '吉娃娃',
        'desc': '吉娃娃是目前人们所知道最古老的犬种之一，原产于美洲，和墨西哥的古老文明有深厚而密切的关系。吉娃娃属小型犬种里最小型，优雅、警惕、动作迅速，以匀称的体格和娇小的体型广受人们的喜爱。它们可以是宗教的守护者，也是平民的好伴侣，上至贵族下至百姓，不分等级不分贵贱。'
    },
    'n02085782-Japanese_spaniel': {
        'id': 2,
        'name': '日本狮子狗',
        'desc': '日本狮子狗，又称日本猎犬，被认为是对日本贵族十分重要的一种狗，由于经常斜视着眼睛而为人们所知。无论是作为一只宠物还是一个伴侣，这种品种都具有独特的传统。'
    },
    'n02085936-Maltese_dog': {
        'id': 3,
        'name': '马尔济斯犬',
        'desc': '马尔济斯犬，又称马尔他犬。身高为20－22厘米，体重2－3千克，是欧洲最古老的犬种，原产于地中海的英国属地－马尔他岛，而得此名。马尔济斯犬迄今已有近3000年的历史，在目前犹存的地中海沿岸的工艺品和美术作品中，仍常可见到马尔济斯犬栩栩如生的艺术形象。'
    },
    'n02086079-Pekinese': {
        'id': 4,
        'name': '京巴犬',
        'desc': '京巴犬又称北京犬、宫廷狮子狗，是中国古老的犬种，已有四千年的历史。它是一种平衡良好，结构紧凑的狗，前躯重而后躯轻。它有个性，表现欲强，性格活泼，聪明通人性，其形象酷似狮子。它代表的勇气、大胆、自尊更胜于漂亮、优雅或精致。'
    },
    'n02086240-Shih-Tzu': {
        'id': 5,
        'name': '西施犬',
        'desc': '西施犬，别名狮子犬，原产中国，起源于17世纪。源于西藏，被饲养在喇嘛庙内作为看门狗。 喇嘛教学问之神曼珠休理经常携带会变狮子的小型犬。外形近似狮子的西藏产的拉萨犬被认为和狮子犬关系密切。被毛较长，需要经常梳理。'
    },
    'n02086646-Blenheim_spaniel': {
        'id': 6,
        'name': '布莱尼姆猎犬',
        'desc': '布莱尼姆猎犬，是英国玩具犬的一个红白猎犬品种，因其长长的耳朵成为人们喜爱的宠物之一。'
    },
    'n02086910-papillon': {
        'id': 7,
        'name': '蝴蝶犬',
        'desc': '蝴蝶犬（英文名为Papillon）又称蝶耳犬和巴比伦犬，因耳朵上的长毛直立装饰，犹如翩翩起舞的蝴蝶而得名。体高20-28厘米，体重3-5公斤，起源于十六世纪，原产于西班牙，是欧洲最古老的品种之一。'
    },
    'n02087046-toy_terrier': {
        'id': 8,
        'name': '玩具猎狐梗',
        'desc': '玩具猎狐梗是一种玩具犬和梗犬的混和犬种，两者都对它的性格和特性产生了影响。作为梗犬，玩具狐梗拥有敏捷的智力，勇气和活泼。作为玩具犬，它小巧，对主人有无尽的持久的爱。玩具猎狐梗是一种平衡性良好的玩具犬，有健壮的外形，显示出高雅和敏捷，以及同等程度的力量和毅力。'
    },
    'n02087394-Rhodesian_ridgeback': {
        'id': 9,
        'name': '罗得西亚脊背犬',
        'desc': '罗得西亚背脊犬（英文名Rhodesian Ridgeback），因为其能够捕猎狮子，又叫猎狮犬。罗德西亚脊背犬强壮、灵活，跑动速度很快。它有高贵的气质，对主人极为忠诚，会和陌生人保持一定的距离。'
    },
    'n02088094-Afghan_hound': {
        'id': 10,
        'name': '阿富汗猎犬',
        'desc': '阿富汗猎犬，是现存的最古老的猎犬犬种之一。此犬种以其厚实、细腻、柔滑的被毛和在末端带有卷曲的尾巴而明显区别于其他犬种。在伊朗东部和阿富汗寒冷的山地特殊环境下，使它们获得这些独特的外观特点。'
    },
    'n02088238-basset': {
        'id': 11,
        'name': '巴吉度猎犬',
        'desc': '巴吉度猎犬(Basset Hound)也称法国短脚猎犬。体高30-48厘米，体重21-25公斤，原产法国，据说是由埃及格雷特猎犬延续繁衍而来的。长身短脚，大而长的垂耳、鼻子嗅觉很敏锐。原被训练为专门捕捉野免、雉鸡等。其腿虽短，但因具有敏锐的嗅觉和长久的耐力，仍不失为追捕猎物的好手。',
    },
    'n02088364-beagle': {
        'id': 12,
        'name': '比格犬',
        'desc': '比格犬又称为“米格鲁猎兔犬”，是世界名犬犬种之一，在分类上属于狩猎犬。头部呈大圆顶的形状，大而榛色的眼睛，广阔的长垂耳，肌肉结实的躯体，尾更粗象鳅鱼状。是漫画史努比的原型犬只。全世界的比格犬大约有十万只左右。'
    },
    'n02088466-bloodhound': {
        'id': 13,
        'name': '寻血猎犬',
        'desc': '寻血猎犬原产地比利时。别名圣·休伯特猎犬（st.huberthound）、侦探犬，是世界上品种最老、血统最纯正、体型最大的嗅觉猎犬之一。具有不屈不挠神奇的嗅觉追踪能力，有事实证明即使是超过14天的气味，它也能追踪到。'
    },
    'n02088632-bluetick': {
        'id': 14,
        'name': '布鲁克浣熊猎犬',
        'desc': '布鲁克浣熊猎犬，起源于路易斯安那。吻突的轮廓为长为方形，宽而深。圆圆的大眼睛是深棕色的。耳朵薄长的位置得很低。腿很直，尾巴高，形成一个点。后肢很长，肌肉发达。'
    },
    'n02089078-black-and-tan_coonhound': {
        'id': 15,
        'name': '黑褐猎浣熊犬',
        'desc': '黑褐色猎浣熊犬毛色绝大部分是黑色，其中还带有大约10-15%的棕褐色斑纹。由于它们经常将浣熊赶上树去，因此也被称为“赶上树”猎犬。猎人根据其不同的吠声来判别和辨识它们。完全依靠嗅觉来执行任务，非常有力的、有节奏的步伐使他具有很快的速度。'
    },
    'n02089867-Walker_hound': {
        'id': 16,
        'name': '沃克猎犬',
    },
    'n02089973-English_foxhound': {
        'id': 17,
        'name': '英国猎狐犬',
        'desc': '英国猎狐犬是四大猎狐犬之一，是美国猎狐犬的表亲，它们是气味猎犬，通过气味来捕猎狐狸。英国猎狐犬被精心饲养了150多年，由猎狐犬主人协会（英国）出版的优良品种登记簿可追溯到1800多年以前，并且对于每一个英国猎狐犬的主人来说，追溯它的血统是一件十分容易的事。'
    },
    'n02090379-redbone': {
        'id': 18,
        'name': '美洲赤狗',
    },
    'n02090622-borzoi': {
        'id': 19,
        'name': '俄罗斯猎狼犬',
        'desc': '波索尔（俄罗斯猎狼犬）是作为在开阔地区追逐野兽的猎犬培养的，主要依靠视觉而不是嗅觉捕猎。为了达到这个目的，波索尔需要非常特殊、精确的身体机构，用来捕捉和控制猎物。波索尔具有明显的高贵气质，流畅的线条，动作和姿态优美。'
    },
    'n02090721-Irish_wolfhound': {
        'id': 20,
        'name': '爱尔兰猎狼犬',
        'desc': '爱尔兰猎狼犬,原产地爱尔兰，起源于公元前100年。它是真正的巨犬，是世界上最高大的狗。外观普遍与灵缇犬相似，其被毛十分杂乱；身体结构结实，且肌肉十分发达，从而显出优雅的姿态。结构坚固、稳定，显示出力量，活跃、勇气和匀称性。'
    },
    'n02091032-Italian_greyhound': {
        'id': 21,
        'name': '意大利灰狗',
    },
    'n02091134-whippet': {
        'id': 22,
        'name': '惠比特犬',
    },
    'n02091244-Ibizan_hound': {
        'id': 23,
        'name': '依比沙猎犬',
    },
    'n02091467-Norwegian_elkhound': {
        'id': 24,
        'name': '挪威猎犬',
    },
    'n02091635-otterhound': {
        'id': 25,
        'name': '奥达猎犬',
    },
    'n02091831-Saluki': {
        'id': 26,
        'name': '沙克犬',
    },
    'n02092002-Scottish_deerhound': {
        'id': 27,
        'name': '苏格兰猎鹿犬',
    },
    'n02092339-Weimaraner': {
        'id': 28,
        'name': '威玛猎犬',
    },
    'n02093256-Staffordshire_bullterrier': {
        'id': 29,
        'name': '斯塔福德郡牛头梗',
    },
    'n02093428-American_Staffordshire_terrier': {
        'id': 30,
        'name': '美国比特斗牛梗',
    },
    'n02093647-Bedlington_terrier': {
        'id': 31,
        'name': '贝德灵顿梗',
    },
    'n02093754-Border_terrier': {
        'id': 32,
        'name': '边境梗',
    },
    'n02093859-Kerry_blue_terrier': {
        'id': 33,
        'name': '凯丽蓝梗',
    },
    'n02093991-Irish_terrier': {
        'id': 34,
        'name': '爱尔兰梗',
    },
    'n02094114-Norfolk_terrier': {
        'id': 35,
        'name': '诺福克梗',
    },
    'n02094258-Norwich_terrier': {
        'id': 36,
        'name': '诺维奇梗',
    },
    'n02094433-Yorkshire_terrier': {
        'id': 37,
        'name': '约克郡梗',
    },
    'n02095314-wire-haired_fox_terrier': {
        'id': 38,
        'name': '刚毛猎狐梗',
    },
    'n02095570-Lakeland_terrier': {
        'id': 39,
        'name': '莱克兰梗',
    },
    'n02095889-Sealyham_terrier': {
        'id': 40,
        'name': '锡利哈姆梗',
    },
    'n02096051-Airedale': {
        'id': 41,
        'name': '艾尔谷犬',
    },
    'n02096177-cairn': {
        'id': 42,
        'name': '凯恩梗',
    },
    'n02096294-Australian_terrier': {
        'id': 43,
        'name': '澳大利亚梗',
    },
    'n02096437-Dandie_Dinmont': {
        'id': 44,
        'name': '丹迪丁蒙梗',
    },
    'n02096585-Boston_bull': {
        'id': 45,
        'name': '波士顿梗',
    },
    'n02097047-miniature_schnauzer': {
        'id': 46,
        'name': '迷你雪纳瑞犬',
    },
    'n02097130-giant_schnauzer': {
        'id': 47,
        'name': '巨型雪纳瑞犬',
    },
    'n02097209-standard_schnauzer': {
        'id': 48,
        'name': '标准雪纳瑞犬',
    },
    'n02097298-Scotch_terrier': {
        'id': 49,
        'name': '苏格兰梗',
    },
    'n02097474-Tibetan_terrier': {
        'id': 50,
        'name': '西藏梗',
    },
    'n02097658-silky_terrier': {
        'id': 51,
        'name': '丝毛梗',
    },
    'n02098105-soft-coated_wheaten_terrier': {
        'id': 52,
        'name': '软毛麦色梗',
    },
    'n02098286-West_Highland_white_terrier': {
        'id': 53,
        'name': '西高地白梗',
    },
    'n02098413-Lhasa': {
        'id': 54,
        'name': '拉萨阿普索犬',
    },
    'n02099267-flat-coated_retriever': {
        'id': 55,
        'name': '平毛寻回犬',
    },
    'n02099429-curly-coated_retriever': {
        'id': 56,
        'name': '卷毛寻回犬',
    },
    'n02099601-golden_retriever': {
        'id': 57,
        'name': '金毛寻回犬',
    },
    'n02099712-Labrador_retriever': {
        'id': 58,
        'name': '拉布拉多猎犬',
    },
    'n02099849-Chesapeake_Bay_retriever': {
        'id': 59,
        'name': '乞沙比克猎犬',
    },
    'n02100236-German_short-haired_pointer': {
        'id': 60,
        'name': '德国短毛猎犬',
    },
    'n02100583-vizsla': {
        'id': 61,
        'name': '维兹拉犬',
    },
    'n02100735-English_setter': {
        'id': 62,
        'name': '英国谍犬',
    },
    'n02100877-Irish_setter': {
        'id': 63,
        'name': '爱尔兰雪达犬',
    },
    'n02101006-Gordon_setter': {
        'id': 64,
        'name': '戈登雪达犬',
    },
    'n02101388-Brittany_spaniel': {
        'id': 65,
        'name': '布列塔尼犬猎犬',
    },
    'n02101556-clumber': {
        'id': 66,
        'name': '黄毛猎犬',
    },
    'n02102040-English_springer': {
        'id': 67,
        'name': '英国史宾格犬',
    },
    'n02102177-Welsh_springer_spaniel': {
        'id': 68,
        'name': '威尔士史宾格犬',
    },
    'n02102318-cocker_spaniel': {
        'id': 69,
        'name': '可卡犬',
    },
    'n02102480-Sussex_spaniel': {
        'id': 70,
        'name': '萨塞克斯猎犬',
    },
    'n02102973-Irish_water_spaniel': {
        'id': 71,
        'name': '爱尔兰水猎犬',
    },
    'n02104029-kuvasz': {
        'id': 72,
        'name': '哥威斯犬',
    },
    'n02104365-schipperke': {
        'id': 73,
        'name': '舒柏奇犬',
    },
    'n02105056-groenendael': {
        'id': 74,
        'name': '比利时牧羊犬',
    },
    'n02105162-malinois': {
        'id': 75,
        'name': '马里努阿犬',
    },
    'n02105251-briard': {
        'id': 76,
        'name': '伯瑞犬',
    },
    'n02105412-kelpie': {
        'id': 77,
        'name': '凯尔皮犬',
    },
    'n02105505-komondor': {
        'id': 78,
        'name': '匈牙利牧羊犬',
    },
    'n02105641-Old_English_sheepdog': {
        'id': 79,
        'name': '老英国牧羊犬',
    },
    'n02105855-Shetland_sheepdog': {
        'id': 80,
        'name': '喜乐蒂牧羊犬'
    },
    'n02106030-collie': {
        'id': 81,
        'name': '牧羊犬',
    },
    'n02106166-Border_collie': {
        'id': 82,
        'name': '边境牧羊犬',
    },
    'n02106382-Bouvier_des_Flandres': {
        'id': 83,
        'name': '法兰德斯牧牛犬',
    },
    'n02106550-Rottweiler': {
        'id': 84,
        'name': '罗特韦尔犬',
    },
    'n02106662-German_shepherd': {
        'id': 85,
        'name': '德国牧羊犬',
    },
    'n02107142-Doberman': {
        'id': 86,
        'name': '多伯曼犬',
    },
    'n02107312-miniature_pinscher': {
        'id': 87,
        'name': '迷你杜宾犬',
    },
    'n02107574-Greater_Swiss_Mountain_dog': {
        'id': 88,
        'name': '大瑞士山地犬',
    },
    'n02107683-Bernese_mountain_dog': {
        'id': 89,
        'name': '伯恩山犬',
    },
    'n02107908-Appenzeller': {
        'id': 90,
        'name': '阿彭策尔犬',
    },
    'n02108000-EntleBucher': {
        'id': 91,
        'name': '恩特雷布赫山地犬',
    },
    'n02108089-boxer': {
        'id': 92,
        'name': '拳师狗',
    },
    'n02108422-bull_mastiff': {
        'id': 93,
        'name': '斗牛獒',
    },
    'n02108551-Tibetan_mastiff': {
        'id': 94,
        'name': '藏獒',
    },
    'n02108915-French_bulldog': {
        'id': 95,
        'name': '法国斗牛犬',
    },
    'n02109047-Great_Dane': {
        'id': 96,
        'name': '大丹犬',
    },
    'n02109525-Saint_Bernard': {
        'id': 97,
        'name': '圣伯纳德犬',
    },
    'n02109961-Eskimo_dog': {
        'id': 98,
        'name': '爱斯基摩犬',
    },
    'n02110063-malamute': {
        'id': 99,
        'name': '阿拉斯加爱斯基摩犬',
    },
    'n02110185-Siberian_husky': {
        'id': 100,
        'name': '哈士奇',
    },
    'n02110627-affenpinscher': {
        'id': 101,
        'name': '狮毛狗',
    },
    'n02110806-basenji': {
        'id': 102,
        'name': '巴辛吉狗',
    },
    'n02110958-pug': {
        'id': 103,
        'name': '哈巴狗',
    },
    'n02111129-Leonberg': {
        'id': 104,
        'name': '莱昂贝格狗',
    },
    'n02111277-Newfoundland': {
        'id': 105,
        'name': '纽芬兰岛狗',
    },
    'n02111500-Great_Pyrenees': {
        'id': 106,
        'name': '大白熊犬',
    },
    'n02111889-Samoyed': {
        'id': 107,
        'name': '萨摩耶犬',
    },
    'n02112018-Pomeranian': {
        'id': 108,
        'name': '博美犬',
    },
    'n02112137-chow': {
        'id': 109,
        'name': '松狮',
    },
    'n02112350-keeshond': {
        'id': 110,
        'name': '荷兰卷尾狮毛狗',
    },
    'n02112706-Brabancon_griffon': {
        'id': 111,
        'name': '布鲁塞尔格林芬犬',
    },
    'n02113023-Pembroke': {
        'id': 112,
        'name': '彭布洛克威尔士科基犬',
    },
    'n02113186-Cardigan': {
        'id': 113,
        'name': '威尔士柯基犬',
    },
    'n02113624-toy_poodle': {
        'id': 114,
        'name': '玩具贵宾犬',
    },
    'n02113712-miniature_poodle': {
        'id': 115,
        'name': '迷你贵宾犬',
    },
    'n02113799-standard_poodle': {
        'id': 116,
        'name': '标准贵宾犬',
    },
    'n02113978-Mexican_hairless': {
        'id': 117,
        'name': '墨西哥无毛犬',
    },
    'n02115641-dingo': {
        'id': 118,
        'name': '澳洲野狗',
    },
    'n02115913-dhole': {
        'id': 119,
        'name': '豺',
    },
    'n02116738-African_hunting_dog': {
        'id': 120,
        'name': '非洲猎犬'
    }
}
